Скрипты/UC7_EditingProfileData/result1/Iteration1/t12.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:PaymentPreferences xmlns:ns2="com.advantage.online.store.accountservice"><ns2:preference><ns2:paymentMethod>10</ns2:paymentMethod><ns2:safePayUsername>Daniel_SP</ns2:safePayUsername><ns2:safePayPassword>c672dec5d0d7bb5a96e6561a06d34fefac12df4e</ns2:safePayPassword><ns2:preferenceId>0</ns2:preferenceId></ns2:preference><ns2:preference><ns2:paymentMethod>20</ns2:paymentMethod><ns2:cardNumber>4886643583646501</ns2:cardNumber><ns2:expirationDate>032031</ns2:expirationDate><ns2:cvvNumber>640</ns2:cvvNumber><ns2:customerName>Daniel</ns2:customerName><ns2:preferenceId>0</ns2:preferenceId></ns2:preference></ns2:PaymentPreferences></SOAP-ENV:Body></SOAP-ENV:Envelope>